# parameters
nc: 1  # number of classes
depth_multiple: 1.0
width_multiple: 1.0

# anchors (P3/8, P4/16, P5/32, P6/64)
anchors:
  - [102,104, 150,153, 192,189]
  - [221,237, 283,243, 274,305]
  - [357,308, 346,389, 456,384]
  - [425,478, 545,481, 586,617]

# ShuffleNetV2 backbone (super light)
backbone:
  [[-1, 1, StemBlock, [32, 3, 2]],          # 0-P1/2
   [-1, 1, ShuffleV2Block, [32, 64, 2]],    # 1-P2/4
   [-1, 1, ShuffleV2Block, [64, 96, 2]],    # 2-P3/8
   [-1, 1, ShuffleV2Block, [96, 192, 2]],   # 3-P4/16
   [-1, 1, ShuffleV2Block, [192, 256, 1]],  # 4
   [-1, 1, ShuffleV2Block, [256, 384, 2]],  # 5-P5/32
   [-1, 1, ShuffleV2Block, [384, 512, 1]],  # 6
   [-1, 1, SPPFSmall, [512, 512]],               # 7
  ]

# Head with P6
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],              # cat P5/32 skip
   [-1, 1, C3, [256, False]],              # 11

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],              # cat P4/16 skip
   [-1, 1, C3, [128, False]],              # 15 (P3/8)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 1, C3, [256, False]],              # 18 (P4/16)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 7], 1, Concat, [1]],
   [-1, 1, C3, [512, False]],              # 23 (P5/32)

   [-1, 1, Conv, [512, 3, 2]],
   [-1, 1, C3, [512, False]],              # 25 (P6/64)

   [[15, 18, 23, 25], 1, Detect, [nc, anchors]],
  ]
